Tekla Open API Reference for Tekla Structures 2025
BendSurface Constructor (Vector, Vector, List<Point>, List<Point>)
 Initializes a new instance of the BendSurface class with given parameters. The boundaries are defined by the lateral boundaries (i.e. the points on the sides of the curved part of the surface). The side boundaries are defined by the two first points and the two last points of the lateral boundaries.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BendSurface(
	Vector endFaceNormal1,
	Vector endFaceNormal2,
	List<Point> lateralBoundary1,
	List<Point> lateralBoundary2
)
Public Sub New (
	endFaceNormal1 As Vector,
	endFaceNormal2 As Vector,
	lateralBoundary1 As List(Of Point),
	lateralBoundary2 As List(Of Point)
)
Parameters
endFaceNormal1
Type: Tekla.Structures.Geometry3d.Vector
 The first end face normal.
endFaceNormal2
Type: Tekla.Structures.Geometry3d.Vector
 The second end face normal.
lateralBoundary1
Type: System.Collections.Generic.List<Point>
 The first lateral boundary
lateralBoundary2
Type: System.Collections.Generic.List<Point>
 The second lateral boundary
Exceptions
Exception | Condition
ArgumentNullException |  Throws an exception if one of the arguments is null.
ArgumentException |  Throws this exception if the boundaries are invalid.
Remarks
This constructor may be numerically instable if the end faces are very close
See Also
Reference
BendSurface Class
BendSurface Overload
Tekla.Structures.Model Namespace